[icc_stage]
init_design = init_design_icc.tcl
flat_dp = flat_dp.tcl
place_opt = place_opt_icc.tcl
clock_opt_cts = clock_opt_cts_icc.tcl
clock_opt_psyn = clock_opt_psyn_icc.tcl
clock_opt_route = clock_opt_route_icc.tcl
route = route_icc.tcl
route_opt = route_opt_icc.tcl

[icc_string]
fail_string = Error:
ignore_string = 
warn_string = Warning:
